results/shelf-10-1k-n10.2.log

Summary:
  Total:	0.0554 secs
  Slowest:	0.0068 secs
  Fastest:	0.0001 secs
  Average:	0.0005 secs
  Requests/sec:	18047.2161
  
  Total data:	2000 bytes
  Size/request:	2 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [880]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.001 [96]	|■■■■
  0.002 [12]	|■
  0.003 [1]	|
  0.003 [0]	|
  0.004 [0]	|
  0.005 [0]	|
  0.005 [0]	|
  0.006 [0]	|
  0.007 [10]	|


Latency distribution:
  10% in 0.0003 secs
  25% in 0.0003 secs
  50% in 0.0004 secs
  75% in 0.0006 secs
  90% in 0.0008 secs
  95% in 0.0011 secs
  99% in 0.0064 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0001 secs, 0.0068 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0018 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0004 secs
  resp wait:	0.0005 secs, 0.0001 secs, 0.0035 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0009 secs

Status code distribution:
  [200]	1000 responses