results/shelf-10-1k.1.log

Summary:
  Total:	0.1197 secs
  Slowest:	0.0089 secs
  Fastest:	0.0006 secs
  Average:	0.0012 secs
  Requests/sec:	8357.1949
  
  Total data:	2000 bytes
  Size/request:	2 bytes

Response time histogram:
  0.001 [1]	|
  0.001 [841]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.002 [133]	|■■■■■■
  0.003 [9]	|
  0.004 [6]	|
  0.005 [1]	|
  0.006 [2]	|
  0.006 [3]	|
  0.007 [2]	|
  0.008 [1]	|
  0.009 [1]	|


Latency distribution:
  10% in 0.0008 secs
  25% in 0.0009 secs
  50% in 0.0011 secs
  75% in 0.0013 secs
  90% in 0.0015 secs
  95% in 0.0018 secs
  99% in 0.0046 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0006 secs, 0.0089 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0017 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	0.0011 secs, 0.0006 secs, 0.0058 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0003 secs

Status code distribution:
  [200]	1000 responses