results/shelf-10-1k.2.log

Summary:
  Total:	0.1002 secs
  Slowest:	0.0071 secs
  Fastest:	0.0004 secs
  Average:	0.0010 secs
  Requests/sec:	9980.9489
  
  Total data:	2000 bytes
  Size/request:	2 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [751]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.002 [227]	|■■■■■■■■■■■■
  0.002 [11]	|■
  0.003 [0]	|
  0.004 [0]	|
  0.004 [0]	|
  0.005 [3]	|
  0.006 [2]	|
  0.006 [2]	|
  0.007 [3]	|


Latency distribution:
  10% in 0.0006 secs
  25% in 0.0008 secs
  50% in 0.0009 secs
  75% in 0.0011 secs
  90% in 0.0014 secs
  95% in 0.0016 secs
  99% in 0.0045 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0004 secs, 0.0071 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0018 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	0.0009 secs, 0.0004 secs, 0.0039 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0003 secs

Status code distribution:
  [200]	1000 responses