results/shelf-100-1k-exe.1.log

Summary:
  Total:	0.0546 secs
  Slowest:	0.0473 secs
  Fastest:	0.0002 secs
  Average:	0.0043 secs
  Requests/sec:	18320.7786
  
  Total data:	2000 bytes
  Size/request:	2 bytes

Response time histogram:
  0.000 [1]	|
  0.005 [886]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.010 [21]	|■
  0.014 [31]	|■
  0.019 [12]	|■
  0.024 [9]	|
  0.028 [4]	|
  0.033 [3]	|
  0.038 [13]	|■
  0.043 [11]	|
  0.047 [9]	|


Latency distribution:
  10% in 0.0013 secs
  25% in 0.0018 secs
  50% in 0.0022 secs
  75% in 0.0030 secs
  90% in 0.0087 secs
  95% in 0.0182 secs
  99% in 0.0425 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0005 secs, 0.0002 secs, 0.0473 secs
  DNS-lookup:	0.0002 secs, 0.0000 secs, 0.0063 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0016 secs
  resp wait:	0.0035 secs, 0.0002 secs, 0.0393 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0015 secs

Status code distribution:
  [200]	1000 responses