results/shelf-100-1k-exe.2.log

Summary:
  Total:	0.0553 secs
  Slowest:	0.0336 secs
  Fastest:	0.0001 secs
  Average:	0.0048 secs
  Requests/sec:	18084.3681
  
  Total data:	2000 bytes
  Size/request:	2 bytes

Response time histogram:
  0.000 [1]	|
  0.003 [641]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.007 [243]	|■■■■■■■■■■■■■■■
  0.010 [3]	|
  0.013 [21]	|■
  0.017 [34]	|■■
  0.020 [14]	|■
  0.024 [11]	|■
  0.027 [5]	|
  0.030 [9]	|■
  0.034 [18]	|■


Latency distribution:
  10% in 0.0017 secs
  25% in 0.0026 secs
  50% in 0.0031 secs
  75% in 0.0038 secs
  90% in 0.0116 secs
  95% in 0.0180 secs
  99% in 0.0316 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0006 secs, 0.0001 secs, 0.0336 secs
  DNS-lookup:	0.0002 secs, 0.0000 secs, 0.0030 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0033 secs
  resp wait:	0.0038 secs, 0.0001 secs, 0.0327 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0023 secs

Status code distribution:
  [200]	1000 responses