results/shelf-100-1k.1.log

Summary:
  Total:	0.0793 secs
  Slowest:	0.0675 secs
  Fastest:	0.0001 secs
  Average:	0.0060 secs
  Requests/sec:	12609.9959
  
  Total data:	2000 bytes
  Size/request:	2 bytes

Response time histogram:
  0.000 [1]	|
  0.007 [888]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.014 [34]	|■■
  0.020 [16]	|■
  0.027 [3]	|
  0.034 [8]	|
  0.041 [5]	|
  0.047 [10]	|
  0.054 [9]	|
  0.061 [14]	|■
  0.068 [12]	|■


Latency distribution:
  10% in 0.0016 secs
  25% in 0.0020 secs
  50% in 0.0028 secs
  75% in 0.0036 secs
  90% in 0.0109 secs
  95% in 0.0344 secs
  99% in 0.0623 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0006 secs, 0.0001 secs, 0.0675 secs
  DNS-lookup:	0.0002 secs, 0.0000 secs, 0.0034 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0023 secs
  resp wait:	0.0051 secs, 0.0001 secs, 0.0592 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0008 secs

Status code distribution:
  [200]	1000 responses