results/shelf-100-1k.2.log

Summary:
  Total:	0.0677 secs
  Slowest:	0.0584 secs
  Fastest:	0.0002 secs
  Average:	0.0051 secs
  Requests/sec:	14772.9673
  
  Total data:	2000 bytes
  Size/request:	2 bytes

Response time histogram:
  0.000 [1]	|
  0.006 [885]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.012 [31]	|■
  0.018 [16]	|■
  0.024 [11]	|
  0.029 [13]	|■
  0.035 [3]	|
  0.041 [11]	|
  0.047 [8]	|
  0.053 [9]	|
  0.058 [12]	|■


Latency distribution:
  10% in 0.0014 secs
  25% in 0.0020 secs
  50% in 0.0023 secs
  75% in 0.0031 secs
  90% in 0.0098 secs
  95% in 0.0259 secs
  99% in 0.0534 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0005 secs, 0.0002 secs, 0.0584 secs
  DNS-lookup:	0.0003 secs, 0.0000 secs, 0.0038 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0023 secs
  resp wait:	0.0042 secs, 0.0002 secs, 0.0496 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0010 secs

Status code distribution:
  [200]	1000 responses