results/shelf-100-1k.3.log

Summary:
  Total:	0.0666 secs
  Slowest:	0.0570 secs
  Fastest:	0.0001 secs
  Average:	0.0051 secs
  Requests/sec:	15022.3081
  
  Total data:	2000 bytes
  Size/request:	2 bytes

Response time histogram:
  0.000 [1]	|
  0.006 [886]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.011 [5]	|
  0.017 [44]	|■■
  0.023 [5]	|
  0.029 [6]	|
  0.034 [11]	|
  0.040 [10]	|
  0.046 [9]	|
  0.051 [11]	|
  0.057 [12]	|■


Latency distribution:
  10% in 0.0014 secs
  25% in 0.0018 secs
  50% in 0.0024 secs
  75% in 0.0030 secs
  90% in 0.0125 secs
  95% in 0.0304 secs
  99% in 0.0524 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0007 secs, 0.0001 secs, 0.0570 secs
  DNS-lookup:	0.0003 secs, 0.0000 secs, 0.0048 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0020 secs
  resp wait:	0.0040 secs, 0.0001 secs, 0.0457 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0020 secs

Status code distribution:
  [200]	1000 responses